Revit 2025 API
ApplicationMacroOptions Enumeration
 The application macro options.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ApplicationMacroOptions
Public Enumeration ApplicationMacroOptions
public enum class ApplicationMacroOptions
type ApplicationMacroOptions
Members
Member name | Value | Description
EnableMacros | 0 |  The option to enable macros for the application.
DisableMacros | 1 |  The option to disable macros for the application.
See Also
Reference
Autodesk.Revit.DB.Macros Namespace